app/controllers/posts_controller.rb

INSERT INTO `posts` (`title`, `description`, `created_at`, `updated_at`) VALUES ('nite', 'iuyfiugiugiug iugiuhoihoi uhiugufifiug iugiuhgiuhgiug', '2023-04-13 06:46:44.616896', '2023-04-13 06:46:44.616896')
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

UPDATE `posts` SET `posts`.`description` = 'iuyfiugiugiug iugiuhoihoi uhiugufifiug iugiuhgiuhgiug jhguyf', `posts`.`updated_at` = '2023-04-13 06:47:19.584449' WHERE `posts`.`id` = 1
---
  def update
    respond_to do |format|
      if @post.update(post_params)